Tekla Open API Reference for Tekla Structures 2025
SettingsProxy Constructor
 Creates a new settings proxy instance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SettingsProxy()
Public Sub New
See Also
Reference
SettingsProxy Class
Tekla.Structures.Datatype Namespace